import React, { useContext, useEffect } from "react";
import { Context } from "..";
import { useNavigate } from "react-router-dom";
import { observer } from "mobx-react-lite";
import pdfIcon from '../img/utils/pdfIcon.svg';
import Garant from "../components/Garant";
import Product from "../components/Product";
import infoBg8 from '../img/info/infoBg8.jpg';
export default observer(function Covid() {
    const navigate = useNavigate();
    const polis = 'assistans';
    const polisTitle = 'Ассистанс';
    const polisType = 'Ассистанс';
    const titleAssistans = <>Страхование<br /> в случае наступления<br />поломки автомобиля<br /><span> Ассистанс</span></>;
    const data = {
        polis,
        polisType,
        polisTitle
    }
    const { store } = useContext(Context);
    useEffect(() => {
        store.setDataPolis(data);
    }, [])
    return (
        <>
            <Product img={infoBg8} title={titleAssistans} />
            <section class="assistans">
                <div class="container">
                    <div class="assistans__inner">
                        <div class="universal__request">
                            <div class="wrapper-gradient">
                                <div class="universal__request-pdf">
                                    <p><span>это электронный полис</span><br />доставляется на электронную почту или в Вайбер,
                                        Телеграм</p>
                                    <img src={pdfIcon} alt="" />
                                </div>
                            </div>
                            <div class="universal__request-btns">
                                <p>Напишите нам в <span>Вайбер</span><br />или <span>заполните заявку</span> на сайте</p>
                                <div class="universal__request-links">
                                    <a href="#">Viber</a>
                                    <a onClick={() => navigate('/fullPolis')} href="#">Подать заявку</a>
                                </div>
                            </div>
                        </div>
                        <div class="universal__content">
                            <h2 class="universal__subtitle">
                                Загальні <span>умови</span>
                            </h2>
                            <h3 class="universal__content-title question-yellow">
                                В разі ДТП або поломки автомобіля Клієнт максимально швидко та безкоштовно отримає такі послуги:
                            </h3>
                            <p class="n-1">Технічна допомога</p>
                            <p class="n-2">Таксі</p>
                            <p class="n-3">Евакуація </p>
                            <p class="n-4">Збереження автомобіля на паркінгу</p>
                            <p class="n-5">Поселення в готелі</p>
                            <p class="n-6">Залізничні, автобусні та авіа квитки</p>
                            <p class="n-7">Прокатний автомобіль</p>
                            <p>Перебуваючи на автомобілі в будь-якій точці України чи Європи, варто лише звернутися за телефоном
                                гарячої лінії і спеціалісти компанії «Гарант-АСІСТАНС» нададуть Клієнту всю необхідну допомогу
                                та подбають про автомобіль, а в разі необхідності, Клієнтові будуть надані додаткові послуги.
                            </p>

                            <p class="n-1">Послуга надається в разі настання Події (ДТП або поломки), що унеможливлює його
                                подальший самостійний рух.</p>
                            <p class="n-2">Евакуація проводиться з місця настання Події до найближчої СТО за вибором Компанії
                                (пріоритет
                                надається авторизованим СТО) відповідно до марки Транспортного засобу Клієнта або до найближчого
                                місця стоянки (гаража).</p>
                            <p class="n-3">У разі, якщо Клієнт бажає евакуювати Транспортний засіб до іншої СТО або місця
                                стоянки (гаража), ніж
                                рекомендовано Компанією, що знаходиться на більш віддаленій відстані від місця Події, Клієнт
                                вимушений буде сплатити за власні кошти різницю між відстанню до бажаної та відстанню до
                                рекомендованої Компанією СТО.</p>
                            <p class="n-4">Послуга надається за рахунок Компанії в рамках лімітів.</p>
                            <p class="n-5">У випадку перевищення встановлених лімітів, Клієнт самостійно сплачує суму, на яку
                                вартість послуги
                                перевищує ліміт.</p>
                            <p>Доставка палива</p>
                            <p>Коли пальне закінчилося раніше, ніж Клієнт зміг дістатися до АЗС, та в результаті чого настала
                                зупинка двигуна:</p>

                            <p class="n-1">Клієнту буде організовано доставку палива до місця зупинки Транспортного засобу;</p>
                            <p class="n-2">вартість та кількість палива Клієнт замовляє та сплачує самостійно.</p>
                            <p>Запуск двигуна від стороннього джерела живлення</p>
                            <p>В разі, якщо АКБ Транспортного засобу втратила свій заряд та спроби самостійно запустити двигун
                                Транспортного засобу не мають результату:</p>

                            <p class="n-1">буде організовано виїзд служби технічної допомоги, яка допоможе Клієнту запустити
                                двигун від стороннього джерела живлення;</p>
                            <p class="n-2">дана послуга включає лише запуск двигуна від стороннього джерела живлення та не
                                передбачає реалізацію чи організацію придбання нових елементів живлення, їх заміни чи ремонту;
                            </p>
                            <p class="n-3">після вдалого запуску двигуна службою технічної допомоги, Клієнт повинен негайно
                                звернутися до рекомендованої Компанією СТО для вирішення проблеми;</p>
                            <p class="n-4">якщо Клієнт після вдалого запуску двигуна службою технічної допомоги не звернувся до
                                рекомендованої Компанією СТО, для ліквідації причин несправності та подібна ситуація виникла
                                повторно, протягом одного місяця, Компанія має право відмовити Клієнту в оплаті послуг
                                повторного виклику служби технічної допомоги чи евакуації;</p>
                            <p class="n-5">у разі невдалих спроб службою технічної допомоги запустити двигун, Клієнту буде
                                запропонована послуга евакуації Транспортного засобу.</p>
                            <p>Розміщення несправного Транспортного засобу на стоянці, що охороняється</p>
                            <p class="n-1">Послуга надається в разі настання Події та подальшої евакуації Транспортного засобу з
                                місця настання Події до найближчої рекомендованої Компанією СТО та в разі, якщо Подія сталася в
                                нічний час або в часи, коли СТО не працює.</p>
                            <p class="n-2">Послуга надається безкоштовно на період до відкриття СТО та в рамках встановлених
                                лімітів.
                                У випадку перевищення встановлених лімітів, Клієнт самостійно сплачує суму, на яку вартість
                                послуги перевищує ліміт.</p>
                            <p>Поселення в готелі</p>

                            <p>Послуга надається Клієнту та пасажирам, що знаходилися у Транспортному засобі на момент настання
                                Події, але кількістю не більше ніж кількість місць для сидіння.</p>
                            <p>Послуга надається в разі настання Події та подальшої евакуації Транспортного засобу з місця
                                настання
                                Події до найближчої рекомендованої Компанією СТО.</p>
                            <p>Послуга надається за таких умов:</p>
                            <p class="n-1">СТО, на яку доставлено Транспортний засіб для ремонту, знаходиться на відстані більше
                                ніж 50 км від місця проживання Клієнта;</p>
                            <p class="n-2">Транспортний засіб неможливо відремонтувати впродовж одного дня та Клієнт вимушений
                                чекати закінчення ремонту до наступного робочого дня СТО.</p>
                            <p>Послуга надається в разі настання Події та подальшої евакуації Транспортного засобу з місця
                                настання Події до найближчої рекомендованої Компанією СТО.
                            </p>
                            <p>Послуга надається за таких умов:</p>


                            <p class="n-1">СТО, на яку доставлено Транспортний засіб для ремонту, знаходиться на відстані більше
                                ніж 50 км від
                                місця проживання Клієнта;</p>
                            <p class="n-2">Транспортний засіб неможливо відремонтувати впродовж одного дня та Клієнт вимушений
                                чекати
                                закінчення ремонту до наступного робочого дня СТО.</p>
                            <p class="n-3">Послуга не комбінується з послугами поселення у готелі та надання прокатного
                                автомобіля.</p>

                            <p>Послуга не комбінується з послугами поселення у готелі та надання прокатного автомобіля.</p>
                            <p>Компанія надає для продовження подорожі квитки (авіа-, автобусні, або залізничні) Клієнту та
                                пасажирам, що знаходилися у Транспортному засобі на момент настання Події, але кількістю не
                                більше
                                ніж кількість місць для сидіння.</p>
                            <p>Компанія надає Клієнту один квиток в зворотному напрямку для отримання відремонтованого
                                Транспортного засобу, але тільки після отримання Компанією інформації від СТО про закінчення
                                ремонту
                                Транспортного засобу.</p>
                            <p>Послуга надається безкоштовно в рамках встановлених лімітів.</p>
                            <p>У випадку перевищення встановлених фінансових лімітів, Клієнт самостійно сплачує суму, на яку
                                вартість послуги перевищує ліміт.</p>
                            <p>В разі, якщо Клієнт самостійно оплачує послугу лише через відсутність у Компанії можливості
                                оплати
                                описаної вище послуги (залежить від часу доби та місцезнаходження Клієнта)
                                та
                                за умови попереднього узгодження з представником Компанії, Компанія відшкодує такі витрати
                                Клієнтові
                                (в межах умов та лімітів) при пред’явлені всіх необхідних документів:</p>
                            <p class="n-1">завіреної належним чином копії свідоцтва про державну реєстрацію юридичної особи або
                                фізичної особи підприємця;</p>
                            <p class="n-2">завіреної належним чином копії свідоцтва про реєстрацію платника податку;</p>
                            <p class="n-3">чеку або квитанції про оплату послуги або оригіналу проїзного документу;</p>
                            <p class="n-4">копії паспорта та довідки про присвоєння ідентифікаційного номеру Клієнта;</p>
                            <p class="n-5">письмової Заяви про відшкодування самостійно сплачених послуг.</p>
                        </div>
                    </div>
                </div>
            </section>
            <Garant />
        </>
    )
})